[
    {
        "name": "Launching January 2026",
        "platform": "Astro, React",
        "description": "I built this marketing site for a dental insurance company using Astro and React components. I also updated the client’s .NET-based enrollment site to update the styling as well as hand off user data from the marketing site.",
        "image": "launching-soon.jpg",
        "alt": "Illustration of an otter with a speech bubble that says 'Launching soon!'",
        "isNDA": "nda"
    },
    {
        "name": "Loyola Today",
        "platform": "Wordpress",
        "description": "Loyola University in Chicago needed to replace their old newsroom site with a more updated, more organized site that accommodated students, faculty, alumni, and media. I helped build the front end of this Wordpress site.",
        "alt": "Screenshot of the Loyola Today homepage.",
        "image": "loyola.jpg"
    },
    {
        "name": "NDA Project",
        "platform": "Laravel Nova, Next.js",
        "description": "This site was built for a global corporation to share marketing ideas and other content. I added custom styling for the Laravel Nova admin site to match the company’s branding, and updated and created pages for the front-end Next.js site.",
        "image": "top-secret.jpg",
        "alt": "Illustration of an otter with a speech bubble that says 'Sorry! This is top secret.'",
        "isNDA": "nda"
    },
    {
        "name": "Hsu’s Ginseng",
        "platform": "Salesforce",
        "description": "I built the front end of this Salesforce site with Salesforce Lightning Web Components, which were then handed over to a development partner for implementation.",
        "alt": "Screenshot of the Hsu's Ginseng homepage.",
        "image": "hsus.jpg"
    },
    {
        "name": "NDA Project",
        "platform": "Contentful, Next.js",
        "description": "I added new fields in Contentful and then created/updated Next.js components in this marketing site for a large fintech organization.",
        "image": "top-secret.jpg",
        "alt": "Illustration of an otter with a speech bubble that says 'Sorry! This is top secret.'",
        "isNDA": "nda"
    },
    {
        "name": "ArtsQuest",
        "platform": "Wordpress",
        "description": "I built the front end of this animation-heavy site for ArtsQuest, a non-profit arts organization located in Pennsylvania.",
        "alt": "Screenshot of the ArtsQuest homepage.",
        "image": "artsquest.jpg"
    }
]